In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [7]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [11]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [13]:
def times2(x):
    return x*2

In [18]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [21]:
df['col2'].apply(lambda x: x**3)

0     87528384
1    170953875
2    295408296
3     87528384
Name: col2, dtype: int64

In [22]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [24]:
df.drop('col1', axis=1, inplace=True)

In [25]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [26]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [31]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [32]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [33]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False